# Python for Data Science
## Session 6
### Datasets â€“ Pandas I

---

## Outline

1. Pandas

2. Loading and exploring datasets 

3. Data cleaning and preprocessing with Pandas

---

## Pandas I

**Pandas** is one of the most used libraries within the Data Science community. It provides a full set of tools to work with:
- 2D data via DataFrame class
    - SQL/Spreadsheet-like datasets (tabular data)
    - Arbitrary matrix data with row and column labels
    - Any type of dataset with observational / statistical data (no labels needed)
- 1D data via Series class
    - Time series data

## Pandas I

As one can see, from the type of datasets **Pandas** can handle, most of the use cases found in Data Science are covered, e.g. finance, health, biology, supply chain, or meteorology. Things **Pandas** do:

1. Handling missing data
2. Change DataFrame size, adding and removing columns and rows at will
3. Automatic data alignment of misaligned data
4. Group by operation
5. Data conversion
6. Advanced indexing
7. Data Merging and joining 
8. Reshaping data
9. Hierarchical indexing
10. Read/write support for CSV, Excel, databases, and fast HDF5 format.
11. Time series manipulation, frequency convertion, window moving statistics

## Pandas I

Let's create a few dataframes using different data structures and see how to start navigating them

In [1]:
## Let's create a simple DataFrame to work with
import pandas as pd
dataset = [
    {
        "name": "Amelie",
        "age": 35
    },
    {
        "name": "Edgar",
        "age": 32
    }
]
df = pd.DataFrame(dataset)
df

     name  age
0  Amelie   35
1   Edgar   32

In [2]:
# Using a slightly different data struture
data = {'Name': ['Amelie', 'Edgar', 'Carlos', 'Victor'],
        'Age': [24, 27, 22, 32],
        'Country': ['FR', 'FR', 'ES', 'GE']}
df = pd.DataFrame(data)
df

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27      FR
2  Carlos   22      ES
3  Victor   32      GE

In [3]:
# we can quickly visualize all the columns a dataframe contains by simply
df.columns

Index(['Name', 'Age', 'Country'], dtype='object')

In [4]:
# Another important thing we can do is to set up any specific index
# these act as row labels
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])
df

     Name  Age Country
A  Amelie   24      FR
B   Edgar   27      FR
C  Carlos   22      ES
D  Victor   32      GE

In [5]:
# Similar to lists and arrays, we can slice
df[:2]

     Name  Age Country
A  Amelie   24      FR
B   Edgar   27      FR

In [6]:
# Similar to lists and arrays, we can also access elements making use of loc and iloc
df.loc['B':'D']

     Name  Age Country
B   Edgar   27      FR
C  Carlos   22      ES
D  Victor   32      GE

In [7]:
# We can access elements using loc and iloc
df.iloc[1:]

     Name  Age Country
B   Edgar   27      FR
C  Carlos   22      ES
D  Victor   32      GE

In [8]:
# We can also access element attributes by using at
df.at[0, 'Age']

KeyError: 0

In [31]:
# if we wanted to do it with iloc, we would need to pass positions
df.iloc[0,1]

np.int64(24)

In [30]:
# Important: to modify a specific value we can use at, loc and iloc
df.loc['B', 'Age'] = 123
df

      Name  Age Country  Residency
A   Amelie   24      FR       True
B  Unknown  123      FR      False
C   Carlos   22      ES       True
D  Unknown   32      GE      False

In [29]:
# we can also check what elements satisfy some criteria by column (attribute)
df['Age'] > 25

A    False
B     True
C    False
D     True
Name: Age, dtype: bool

In [28]:
# and show them
df[df['Age'] > 25]

      Name  Age Country  Residency
B  Unknown   27      FR      False
D  Unknown   32      GE      False

In [27]:
# or modify a simple attribute of those that satisfy certain condition
df.loc[df['Age'] > 25, 'Name'] = 'Unknown' # df.iloc[df['Age'] > 25, 0] = 'Unknown'
df

      Name  Age Country  Residency
A   Amelie   24      FR       True
B  Unknown   27      FR      False
C   Carlos   22      ES       True
D  Unknown   32      GE      False

In [26]:
# we can also, similar to the way we do with dicts, add new columns
df['Residency'] = [True, False, True, False]

In [25]:
# or add new elements
df.loc[6] = ['Jordi', 23, 'ES', False]
df.loc[9] = ['Anna', 19, 'ES', False]
df

ValueError: cannot set a row with mismatched columns

In [24]:
# There are other methods one can also call
df.head(2)

     Name  Age Country
A  Amelie   24      FR
B   Edgar   27      FR

In [23]:
# There are other methods one can also call
df.tail(2)

     Name  Age Country
C  Carlos   22      ES
D  Victor   32      GE

In [22]:
df.shape # to get the dataframe shape

(4, 3)

In [21]:
df.dtypes

Name       object
Age         int64
Country    object
dtype: object

In [20]:
df['Age'].astype('float')

A    24.0
B    27.0
C    22.0
D    32.0
Name: Age, dtype: float64

In [19]:
# Same as numpy, we can find the unique method
df['Country'].unique()

array(['FR', 'ES', 'GE'], dtype=object)

## Pandas I

Among the different methods two important ones are **info** and **describe**:

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Age      4 non-null      int64
 2   Country  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [18]:
df.describe()

             Age
count   4.000000
mean   26.250000
std     4.349329
min    22.000000
25%    23.500000
50%    25.500000
75%    28.250000
max    32.000000

## Pandas I

And how do we know about missing elements and handle them?

In [32]:
# What about missing values? Missing values are usually represented as NaN (Not a Number)
import numpy as np
data = {'Name': ['Amelie', 'Edgar', 'Carlos', 'Victor'],
        'Age': [24, 27, 22, 32],
        'Country': ['FR', np.nan, 'ES', 'GE']}
df = pd.DataFrame(data)
df

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27     NaN
2  Carlos   22      ES
3  Victor   32      GE

In [33]:
# we can simply know which ones present missing values by using isna or isnull
df.isna() # at the whole dataframe level

    Name    Age  Country
0  False  False    False
1  False  False     True
2  False  False    False
3  False  False    False

In [34]:
# and at the column level
df['Country'].isnull() # same as .isna()

0    False
1     True
2    False
3    False
Name: Country, dtype: bool

In [35]:
# Simple way of filling these ones is achieved by calling fillna
df.fillna('RE')

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27      RE
2  Carlos   22      ES
3  Victor   32      GE

In [36]:
# There's also possible thing you can do, use the mode (most common value)
#df['Country'].mode()
df.fillna(df['Country'].mode()[0])

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27      ES
2  Carlos   22      ES
3  Victor   32      GE

In [37]:
# IMPORTANT: if we check again the dataframe, we will see that the dataframe keeps having NaNs
# This is because the intented behaviour is usually to keep the DataFrame immutable
# If you want to actually modify you can pass ot fillna, inplace=True
df

     Name  Age Country
0  Amelie   24      FR
1   Edgar   27     NaN
2  Carlos   22      ES
3  Victor   32      GE

In [38]:
# A more drastic operation is to drop any column or row with missing values using
# here, we will modify the original dataframe and drop the rows and cols with nans
df.at[0, 'Age'] = np.nan
df

     Name   Age Country
0  Amelie   NaN      FR
1   Edgar  27.0     NaN
2  Carlos  22.0      ES
3  Victor  32.0      GE

In [39]:
df.dropna()

     Name   Age Country
2  Carlos  22.0      ES
3  Victor  32.0      GE

## Pandas I

One of the handy tools you have in **Pandas** is **groupby**. It allows you to group by any unique attributes within a column and get statistics:
- count
- mean
- sum
- min and max
- multiple aggregations
- group using multiple columns

In [40]:
data = {
    'Name': ['Amelie', 'Edgar', 'Carlos', 'Victor', 'Sofia', 'Jin', 
             'Marta', 'Ali', 'Emily', 'Ravi', 'Chen', 'Fatima', 'Saham'],
    'Age': [24, 27, 22, 32, 29, 31, 28, 26, 23, 34, 25, 30, 26],
    'Country': ['FR', 'US', 'ES', 'GE', 'PT', 'KR',
                'ES', 'AE', 'US', 'IN', 'CN', 'AE', 'AE'],
    'Salary': [70000, 110000, 65000, 82000, 48000, 39000, 45000,
            90000, 97000, 31000, 49000, 85000, 80000]   
}

df = pd.DataFrame(data)
df

      Name  Age Country  Salary
0   Amelie   24      FR   70000
1    Edgar   27      US  110000
2   Carlos   22      ES   65000
3   Victor   32      GE   82000
4    Sofia   29      PT   48000
5      Jin   31      KR   39000
6    Marta   28      ES   45000
7      Ali   26      AE   90000
8    Emily   23      US   97000
9     Ravi   34      IN   31000
10    Chen   25      CN   49000
11  Fatima   30      AE   85000
12   Saham   26      AE   80000

In [41]:
# let's count how many we have per country
df.groupby('Country').count()

         Name  Age  Salary
Country
AE          3    3       3
CN          1    1       1
ES          2    2       2
FR          1    1       1
GE          1    1       1
IN          1    1       1
KR          1    1       1
PT          1    1       1
US          2    2       2

In [42]:
df.groupby('Country')['Age'].mean() # now let's know the average age per country

Country
AE    27.333333
CN    25.000000
ES    25.000000
FR    24.000000
GE    32.000000
IN    34.000000
KR    31.000000
PT    29.000000
US    25.000000
Name: Age, dtype: float64

In [43]:
df.groupby('Country')['Salary'].sum() # total sum of their salaries

Country
AE    255000
CN     49000
ES    110000
FR     70000
GE     82000
IN     31000
KR     39000
PT     48000
US    207000
Name: Salary, dtype: int64

In [44]:
#Â Multiple Aggregations
df.groupby('Country').agg({'Salary': ['min', 'max'], 'Age': 'mean'})

        Salary                Age
           min     max       mean
Country
AE       80000   90000  27.333333
CN       49000   49000  25.000000
ES       45000   65000  25.000000
FR       70000   70000  24.000000
GE       82000   82000  32.000000
IN       31000   31000  34.000000
KR       39000   39000  31.000000
PT       48000   48000  29.000000
US       97000  110000  25.000000

In [45]:
# grouping using more than one column
df.groupby(['Country', 'Age'])['Salary'].count()

Country  Age
AE       26     2
         30     1
CN       25     1
ES       22     1
         28     1
FR       24     1
GE       32     1
IN       34     1
KR       31     1
PT       29     1
US       23     1
         27     1
Name: Salary, dtype: int64

## Pandas I

Let's load *Netflix* titles and do some exercices

In [47]:
# Download from Moodle the zip file containing the netflix dataset
path = '/Users/carlamontagudboira/Desktop/PYTHON FOR DATA SCIENCE/PYTHON-I/CLASE 6/netflix_titles.csv'

df = pd.read_csv(path)

In [48]:
df.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

## Pandas I
Let's do the following exercices:

1. Count Missing Values in Each Column

2. Fill Missing 'country' Values with "Unknown"

3. Filter for TV Shows Only

4. Count the Number of Entries per Rating

5. Add a Column Showing Content Age (how many years since it came out)

## Pandas I

Let's now load the *Titanic* dataset and practice a little bit more:

1. Count the Missing Values in Each Column

2. Fill Missing 'Age' Values with the Mean Age

3. Fill Missing 'Embarked' Values with the Mode (Most Common Value)

4. Filter and Display Passengers Who Paid a Fare Above the Average Fare

5. Add a New Column Indicating Family Size. Create a new column 'FamilySize' as the sum of 'SibSp' (siblings/spouses) and 'Parch' (parents/children)

In [49]:
path = '/Users/carlamontagudboira/Desktop/PYTHON FOR DATA SCIENCE/PYTHON-I/CLASE 6/train_and_test2.csv'

df = pd.read_csv(path)

## Pandas I

Home exercises for Netflix:

1. Is there any missing rating?
2. How many films in 2021 correspond to your country?
3. What's the number of movies in 2020 with full information?
4. Give me the year with more titles,
5. and what has been the average in terms of releases from 2010. 

And for Titanic:

1. Calculate Gender-Based Survival Percentage

2. Calculate Survival Percentage Grouped by Gender and Class

In [ ]:
#NETFLIX 1 - IS THERE ANY MISSING RATING?

In [52]:
df = pd.read_csv('netflix_titles.csv')

missing_ratings = df['rating'].isnull().sum()
print(f"Number of missing ratings: {missing_ratings}")

Number of missing ratings: 4

In [ ]:
#NETFLIX 2- HOW MANY FILMS IN 2021 CORRESPOND TO YOUR COUNTRY?

In [53]:
movies_2021_spain = df[(df['type'] == 'Movie') & (df['release_year'] == 2021) & (df['country'].str.contains('Spain', na=False))]

num_movies_2021_spain = movies_2021_spain.shape[0]
print(f"Number of movies from Spain released in 2021: {num_movies_2021_spain}")

Number of movies from Spain released in 2021: 6

In [ ]:
#NETFLIX 3- WHAT'S THE NUMBER OF MOVIES IN 2020 WITH FULL INFORMATION?

In [54]:
movies_2020 = df[(df['type'] == 'Movie') & (df['release_year'] == 2020)]

movies_2020_full_info = movies_2020.dropna()

num_movies_2020_full_info = movies_2020_full_info.shape[0]
print(f"Number of movies in 2020 with full information: {num_movies_2020_full_info}")

Number of movies in 2020 with full information: 409

In [ ]:
#NETFLIX 4- WHICH YEAR HAS THE MOST TITLES?

In [56]:
titles_per_year = df.groupby('release_year').size()

max_titles_year = titles_per_year.idxmax()
max_titles_count = titles_per_year.max()
print(f"The year with the most titles is {max_titles_year} with {max_titles_count} titles.")

The year with the most titles is 2018 with 1147 titles.

In [ ]:
#NETFLIX 5- WHAT HAS BEEN THE AVERAGE NUMBER OF RELEASES PER YEAR SINCE 2010?

In [57]:
df_2010_onwards = df[df['release_year'] >= 2010]

titles_per_year_2010_onwards = df_2010_onwards.groupby('release_year').size()

average_releases_per_year = titles_per_year_2010_onwards.mean()
print(f"The average number of releases per year since 2010 is approximately {average_releases_per_year:.2f}.")

The average number of releases per year since 2010 is approximately 622.67.

In [ ]:
#TITANIC 1- CALCULATE GENDER-BASED SURVIVAL PERCENTAGE

In [62]:

df = pd.read_csv('train_and_test2.csv')

gender_counts = df['Sex'].value_counts()

gender_survival_counts = df[df['2urvived'] == 1]['Sex'].value_counts()

gender_survival_percentage = (gender_survival_counts / gender_counts) * 100
print("Gender-Based Survival Percentage:")
print(gender_survival_percentage)

Gender-Based Survival Percentage:
Sex
0    12.930012
1    50.000000
Name: count, dtype: float64

In [ ]:
#TITANIC 2- CALCULATE SURVIVAL PERCENTAGE GROUPED BY GENDER AND CLASS

In [63]:
survival_by_gender_class = df.groupby(['Sex', 'Pclass'])['2urvived'].mean() * 100

print("Survival Percentage Grouped by Gender and Class:")
print(survival_by_gender_class)

Survival Percentage Grouped by Gender and Class:
Sex  Pclass
0    1         25.139665
     2          9.941520
     3          9.533469
1    1         63.194444
     2         66.037736
     3         33.333333
Name: 2urvived, dtype: float64